<a href="https://colab.research.google.com/github/jugalpanchal/py-pilgrim/blob/main/pd_dt_route.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

### 1D Array

In [2]:
# 1D Array
np_array = np.random.rand(3) # type: float64
print(type(np_array))

print(np_array)

<class 'numpy.ndarray'>
[0.56178338 0.22720362 0.2406309 ]

### Series

In [3]:
# Pandas Series - contains labels
first_series = pd.Series(np_array) # class: Series class
print(type(first_series))

print(first_series)

<class 'pandas.core.series.Series'>
0    0.561783
1    0.227204
2    0.240631
dtype: float64

In [4]:
# Pandas Series - custom labels
second_series = pd.Series(np_array, index = ["First", "Second", "Third"])
print(type(second_series))

print(second_series)
print('\n', second_series[1]) # apply index
print('\n', second_series["Second"]) # apply custom index
print('\n', second_series.index)

<class 'pandas.core.series.Series'>
First     0.561783
Second    0.227204
Third     0.240631
dtype: float64

 0.22720361896734698

 0.22720361896734698

 Index(['First', 'Second', 'Third'], dtype='object')

### 2D Array

In [5]:
# 2D Array
np_2d_array = np.random.rand(3, 2)
print(type(np_2d_array))

print(np_2d_array)
print(np_2d_array[2, 1])

<class 'numpy.ndarray'>
[[0.11761218 0.06623602]
 [0.86027435 0.33563339]
 [0.75251484 0.71645138]]
0.7164513829149873

In [6]:
# Pandas DataFrame - along with row and col index/label
first_df = pd.DataFrame(np_2d_array) # class: DataFrame
print(type(first_df))

print(first_df) # prints values with index
# print(first_df[2,1]) # it fails :) - KeyError: (2, 1)
print(first_df.columns)
first_df.columns = ["First", "Second"]

print(first_df)
print(first_df["Second"]) # It returns a series now.
# print(first_df[1, "second"]) # it fails :) - KeyError: (1, 'second')
print(first_df['Second'].values[1]) # the values gives a numpy array.

<class 'pandas.core.frame.DataFrame'>
          0         1
0  0.117612  0.066236
1  0.860274  0.335633
2  0.752515  0.716451
RangeIndex(start=0, stop=2, step=1)
      First    Second
0  0.117612  0.066236
1  0.860274  0.335633
2  0.752515  0.716451
0    0.066236
1    0.335633
2    0.716451
Name: Second, dtype: float64
0.33563339232050937

### Indexing: iat, at, iloc, loc

In [7]:
# iat, at, iloc, loc
print('2nd row and 2nd col: ', first_df.iat[1, 1])
print('2nd row and 2nd col: ', first_df.at[1, "Second"])

print('\nColumns:')
print(first_df.iloc[1])

print('\n')
print('2nd row and 2nd col: ', first_df.iloc[1, 1])
print('2nd row and 2nd col: ', first_df.iloc[1]["Second"])

# loc(row index/range/Series), col index/range/Series/ColumnName) - by labels(Label is part of DataFrame, first column but it does not include in positon count)
# iloc(row index/range/Series, col index/range/Series/ColumnName) - by position(position starts with 0)

#index: 2
#range: [start:n] - n is number of data points.
#WildCard: [:] - it gives all rows/cols.
#Series: [3, 6, 8, 103]

2nd row and 2nd col:  0.33563339232050937
2nd row and 2nd col:  0.33563339232050937

Columns:
First     0.860274
Second    0.335633
Name: 1, dtype: float64


2nd row and 2nd col:  0.33563339232050937
2nd row and 2nd col:  0.33563339232050937

### Create a dataframe

In [8]:
records = [("Espresso", 5, 4),
           ("Brew", 4, 6),
           ("Flat White", 3, 7)]

df2 = pd.DataFrame.from_records(records)
print(df2)
print('\n')

df3 = pd.DataFrame.from_records(records, columns=["Coffee", "Price", "Qty"]) # Add columns
print(df3)
print('\n')

df31 = df3.append(df3)
print(df31)

            0  1  2
0    Espresso  5  4
1        Brew  4  6
2  Flat White  3  7


       Coffee  Price  Qty
0    Espresso      5    4
1        Brew      4    6
2  Flat White      3    7


       Coffee  Price  Qty
0    Espresso      5    4
1        Brew      4    6
2  Flat White      3    7
0    Espresso      5    4
1        Brew      4    6
2  Flat White      3    7

### Filter Columns

In [9]:
print(df3['Coffee'])
print('\n')

print(df3[['Coffee','Qty']])
print('\n')

df3.loc[df3['Coffee'] == 'Brew']

0      Espresso
1          Brew
2    Flat White
Name: Coffee, dtype: object


       Coffee  Qty
0    Espresso    4
1        Brew    6
2  Flat White    7

  Coffee  Price  Qty
1   Brew      4    6

### New Column

In [10]:
total = df3["Price"] * df3["Qty"] # if value is not numeric then we can covert it if required.
df3 = df3.assign(Total = total) # create a new column
print(df3)

       Coffee  Price  Qty  Total
0    Espresso      5    4     20
1        Brew      4    6     24
2  Flat White      3    7     21

### Meth Methods

In [11]:
print('Max Value:            ', df3['Total'].max())

print('Max Value Label/Index:', df3['Total'].idxmax()) # It can be used further to help to get a entire row.

Max Value:             24
Max Value Label/Index: 1

### Replace anomalies to NaN

In [12]:
records = [("Espresso", "5"),
           ("Cappuccino", "5A"),
           ("Americano", "NaN"),
           ("Brew", "5D"),
           ("Flat White", "10")]
df4 = pd.DataFrame.from_records(records, columns=["Coffee", "Price"])
print(df4)
print('\n')

df4.loc[:, 'Price'] = pd.to_numeric(df4['Price'], errors='coerce') # replace no valid data to NaN and convert str to numeric
print(df4)

       Coffee Price
0    Espresso     5
1  Cappuccino    5A
2   Americano   NaN
3        Brew    5D
4  Flat White    10


       Coffee  Price
0    Espresso    5.0
1  Cappuccino    NaN
2   Americano    NaN
3        Brew    NaN
4  Flat White   10.0

In [13]:
# Series - fillna
np_array_2 = ["A", np.nan, "C", "D"]
third_series = pd.Series(np_array_2, index = ["A_Col", "B_Col", "C_Col", "D_Col"])
print(type(third_series))
print(third_series)

four_series = third_series.fillna("B") # fill missing data
print(four_series)

<class 'pandas.core.series.Series'>
A_Col      A
B_Col    NaN
C_Col      C
D_Col      D
dtype: object
A_Col    A
B_Col    B
C_Col    C
D_Col    D
dtype: object

In [14]:
# DataFrame - fillna
# https://docs.w3cub.com/pandas~0.25/reference/api/pandas.series.fillna
df41 = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                    columns=list('ABCD'))

df41.fillna(9)

     A    B    C  D
0  9.0  2.0  9.0  0
1  3.0  4.0  9.0  1
2  9.0  9.0  9.0  5
3  9.0  3.0  9.0  4

### Groups

In [41]:
# Aggregation - return one(ex min) value from each group
# Trasformation - change/replace(ex replace NaN with frequently/min available in a column) some value and return same kind of dataframe
# Filtering - minimize data by filer or where clause

# create a dataset
records = [("Espresso", "Shop1", 5),
           ("Cappuccino", "Shop2", 6),
           ("Americano", "Shop3", "NaN"),
           ("Brew", "Shop1", 3),
           ("Flat White", "Shop2", 10)]
df5 = pd.DataFrame.from_records(records, columns=["Coffee", "Shop", "Price"])
print(df5)
print('\n')

       Coffee   Shop Price
0    Espresso  Shop1     5
1  Cappuccino  Shop2     6
2   Americano  Shop3   NaN
3        Brew  Shop1     3
4  Flat White  Shop2    10

In [46]:
df6 = df5.copy() # create a clone

grouped_df6 = df6.groupby('Shop') #class: DataFrameGroupBy
print(type(grouped_df6))
print('\n')

# Classic Iterate and Aggregate way1: Iterate DataFrameGroupBy object
for group_name, group_df in grouped_df6: # group name, group dataframe
  print(group_name)
  print(group_df)
  min_price = group_df['Price'].min() # Aggregate: min price in each group
  print("{}: {}".format(group_name, min_price))
  print('\n')

# Aggregate: way2: min price in each group
min_price_byagg = grouped_df6['Price'].agg(np.min)
print('min_price_byagg:', min_price_byagg) #way 2.1
print('\n')
min_price_bymin = grouped_df6['Price'].min()
print('min_price_bymin:', min_price_bymin) #way 2.2
print('\n')

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>


Shop1
     Coffee   Shop Price
0  Espresso  Shop1     5
3      Brew  Shop1     3
Shop1: 3


Shop2
       Coffee   Shop Price
1  Cappuccino  Shop2     6
4  Flat White  Shop2    10
Shop2: 6


Shop3
      Coffee   Shop Price
2  Americano  Shop3   NaN
Shop3: NaN


min_price_byagg: Shop
Shop1      3
Shop2      6
Shop3    NaN
Name: Price, dtype: object


min_price_bymin: Shop
Shop1      3
Shop2      6
Shop3    NaN
Name: Price, dtype: object

In [63]:
# Filter
# https://docs.w3cub.com/pandas~0.25/reference/api/pandas.core.groupby.dataframegroupby.filter

df7 = df5.copy() # create a clone
grouped_df7 = df6.groupby('Shop') #class: DataFrameGroupBy

condition_exp = lambda x: x['Price'].mean() > 4
filtered_df = grouped_df7.filter(condition_exp)
print(filtered_df)
print('\n')


df7 = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar'],
                    'B' : [1, 2, 3, 4, 5, 6],
                    'C' : [2.0, 5., 8., 1., 2., 9.]})
print(df7)
#df7.groupby('Shop')

# Transform
grouped_price = df6['Price']
#grouped_price.transform(func)

       Coffee   Shop Price
1  Cappuccino  Shop2     6
4  Flat White  Shop2    10


     A  B    C
0  foo  1  2.0
1  bar  2  5.0
2  foo  3  8.0
3  bar  4  1.0
4  foo  5  2.0
5  bar  6  9.0